Revit 2026 API

# FamilyTypeHasValue Method

---

Indicates if this family parameter has an assigned value or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasValue(
	FamilyParameter familyParameter
)
```
```vb
Public Function HasValue (
	familyParameter As FamilyParameter
) As Boolean
```
```cpp
public:
bool HasValue(
	FamilyParameter^ familyParameter
)
```
```fsharp
member HasValue :
        familyParameter : FamilyParameter -> bool
```

#### Parameters

familyParameter FamilyParameter

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown if the input argument-"familyParameter"-is invalid. |

#### Reference

FamilyType Class

Autodesk.Revit.DB Namespace